#+title: Set default download repo
#+author: Marcus Birkenkrahe
#+subtitle: Practice notebook for DSC 205 Spring 2022
#+options: toc:nil ^:nil
#+startup: hideblocks overview
** Change package installation repository

   * [ ] The utility function ~options~ allows you to set the default
     download repository. What is it right now?

   * [ ] Open the help for ~options~ (you need to go to the ~*R*~ session
     buffer to do this, or open a new buffer with ~M-x R~).

   * [ ] Write a function ~frepos~ that changes the installation
     repository to the URL ~"https://cloud.r-project.org/"~. The
     function should take one argument only - a ~character~ vector
     with the repo URL as its only element.

     #+name: repos
     #+begin_src R :exports both :session :results silent
       frepos <- function(x) options(repos=x)
       r <- c("https://cloud.r-project.org/")
       frepos(r)
       save(frepos, file='~/frepos')
     #+end_src

   * [ ] The chosen URL automatically picks the nearest CRAN
     mirror. Though the output from [[repos]] is set to ~silent~, you
     should see the mirror site URL in the echo area at the bottom.

   * [ ] To directly check success, run the ~getOption~ function on
     the attribute of ~options~ that you just changed in ~frepos~

     #+name: getOption
     #+begin_src R :exports both :session :results output
       getOption("repos")
     #+end_src

     #+RESULTS: getOption
     : [1] "https://cloud.r-project.org/"

   * To test the function, you need to install a package. Let's use
     ~ggplot2~ for that, since we're going to need it soon.

